import random


# ==========================================
# جمله‌های سرعت تایپ
# ==========================================


sentences = {

    "easy": [

        "سلام دنیا",
        "امروز هوا خوب است.",
        "من بازی دوست دارم.",
        "تمرین باعث موفقیت می‌شود.",
        "کتاب دوست خوبی است."

    ],


    "medium": [

        "برنامه نویسی با پایتون خیلی جذاب است.",
        "ماینکرفت یکی از بازی‌های محبوب دنیاست.",
        "هر روز تمرین کردن باعث بهتر شدن می‌شود.",
        "ساخت ربات نیاز به صبر و تلاش دارد.",
        "Bangame یک پروژه بزرگ بازی است."

    ],


    "hard": [

        "هوش مصنوعی و برنامه نویسی در آینده نقش بسیار مهمی خواهند داشت.",
        "ساخت یک ربات حرفه‌ای نیازمند طراحی درست و مدیریت خطاها است.",
        "موفقیت در هر کاری نتیجه تلاش مداوم و یادگیری از اشتباهات است.",
        "توسعه نرم افزار یک مسیر طولانی اما بسیار هیجان انگیز است.",
        "افراد موفق همیشه برای بهتر شدن مهارت‌های خود تلاش می‌کنند."

    ]

}



# ==========================================
# ساخت بازی
# ==========================================

def create_game(level="easy"):


    sentence = random.choice(
        sentences[level]
    )


    return {

        "sentence": sentence,

        "level": level

    }



# ==========================================
# بررسی جواب
# ==========================================

def check(game, text):


    return (
        text.strip()
        ==
        game["sentence"]
    )