import random


# ==========================================
# کلمات بازی
# ==========================================

WORDS = {

    "easy": [

        "ماشین",
        "کتاب",
        "مدرسه",
        "درخت",
        "خورشید",
        "باران",
        "گربه",
        "سگ",
        "خانه",
        "دوست"

    ],

    "medium": [

        "کامپیوتر",
        "تلفن",
        "دانشگاه",
        "برنامه",
        "اینترنت",
        "آزمایش",
        "ورزشگاه",
        "موتورسیکلت",
        "رستوران",
        "دوچرخه"

    ],

    "hard": [

        "برنامه‌نویسی",
        "هوش‌مصنوعی",
        "الگوریتم",
        "پردازشگر",
        "سیستم‌عامل",
        "فناوری",
        "امنیت‌سایبری",
        "پایگاه‌داده",
        "شبکه‌کامپیوتری",
        "میکروکنترلر"

    ]

}


# ==========================================
# ساخت بازی
# ==========================================

def create_game(level):

    word = random.choice(
        WORDS[level]
    )

    hidden = list(word)

    count = max(
        1,
        len(word) // 3
    )

    indexes = random.sample(
        range(len(word)),
        count
    )

    for i in indexes:

        hidden[i] = "_"


    return {

        "level": level,

        "word": word,

        "hidden": "".join(hidden)

    }


# ==========================================
# بررسی جواب
# ==========================================

def check(game, answer):

    return answer.strip() == game["word"]