from rubika import send_keypad


# ==========================================
# دسته‌بندی‌ها
# ==========================================

CATEGORIES = [
    "👤 اسم",
    "🏠 فامیل",
    "🍎 میوه",
    "🍔 غذا",
    "🎨 رنگ",
    "📦 اشیا",
    "🐶 حیوان",
    "🌍 شهر یا کشور",
    "🖐 اعضای بدن",
    "🎬 فیلم یا سریال"
]


# ==========================================
# منوی اصلی بازی
# ==========================================

def show_categories(chat_id):

    keyboard = []

    for category in CATEGORIES:
        keyboard.append([category])

    keyboard.append(["✅ آماده‌ام"])
    keyboard.append(["🚪 خروج از بازی"])

    send_keypad(
        chat_id,
        "📚 یکی از دسته‌ها را انتخاب کن:",
        keyboard
    )


# ==========================================
# بعد از ثبت جواب
# ==========================================

def show_after_save(chat_id):

    keyboard = []

    for category in CATEGORIES:
        keyboard.append([category])

    keyboard.append(["✅ آماده‌ام"])
    keyboard.append(["🚪 خروج از بازی"])

    send_keypad(
        chat_id,
        "✅ جواب ذخیره شد.\n\nاگر خواستی می‌توانی دسته دیگری را انتخاب یا جواب قبلی را ویرایش کنی.",
        keyboard
    )


# ==========================================
# درخواست نوشتن جواب
# ==========================================

def ask_for_answer(chat_id, category, letter):

    send_keypad(
        chat_id,
        f"🔤 حرف: {letter}\n\n"
        f"✍️ جواب بخش {category} را ارسال کن.",
        [
            ["⬅️ انصراف"]
        ]
    )


# ==========================================
# وقتی آماده شد
# ==========================================

def show_waiting(chat_id):

    send_keypad(
        chat_id,
        "⏳ آماده شدی.\n"
        "منتظر بقیه بازیکنان باش...",
        [
            ["🚪 خروج از بازی"]
        ]
    )