import random

from rubika import send_keypad, send_message


# ==========================================
# بازی های فعال اسم و فامیل
# ==========================================

games = {}


# ==========================================
# دسته بندی ها
# ==========================================

categories = [
    "👤 اسم",
    "🏠 فامیل",
    "🍎 میوه",
    "🍔 غذا",
    "🎨 رنگ",
    "📦 اشیا",
    "🐶 حیوان",
    "🌍 شهر یا کشور",
    "🖐 اعضای بدن",
    "🎬 فیلم یا سریال"
]


# ==========================================
# حروف قابل استفاده
# ==========================================

letters = [
    "ا",
    "ب",
    "پ",
    "ت",
    "ج",
    "چ",
    "ح",
    "خ",
    "د",
    "ر",
    "ز",
    "س",
    "ش",
    "ص",
    "ط",
    "ع",
    "غ",
    "ف",
    "ق",
    "ک",
    "گ",
    "ل",
    "م",
    "ن",
    "و",
    "ه",
    "ی"
]


# ==========================================
# شروع بازی
# ==========================================

def start(room):

    letter = random.choice(
        letters
    )


    games[room.room_id] = {

        "letter": letter,

        "answers": {},

        "players": room.players
    }



    for player in room.players:


        send_message(
            player,
            f"✍️ بازی اسم و فامیل شروع شد!\n\n"
            f"🔤 حرف انتخاب شده: {letter}\n\n"
            f"یکی از دسته‌ها را انتخاب کن."
        )


        send_keypad(
            player,
            "📚 دسته موردنظر را انتخاب کن:",
            [
                ["👤 اسم"],
                ["🏠 فامیل"],
                ["🍎 میوه"],
                ["🍔 غذا"],
                ["🎨 رنگ"],
                ["📦 اشیا"],
                ["🐶 حیوان"],
                ["🌍 شهر یا کشور"],
                ["🖐 اعضای بدن"],
                ["🎬 فیلم یا سریال"],
                ["🚪 خروج از بازی"]
            ]
        )
        # ==========================================
# خروج از بازی اسم و فامیل
# ==========================================

def exit_game(room_id, chat_id):

    if room_id in games:

        games[room_id]["players"] = [
            p for p in games[room_id]["players"]
            if p != chat_id
        ]

        send_message(
            chat_id,
            "🚪 از بازی اسم و فامیل خارج شدی."
        )


        # اگر کسی باقی نماند، بازی پاک شود

        if len(games[room_id]["players"]) == 0:

            del games[room_id]