from rubika import send_keypad


# ==========================================
# منوی اصلی
# ==========================================

def main_menu(chat_id):

    send_keypad(
        chat_id,
        "👋 دوباره خوش آمدی به Bangame!\n\nاز منوی زیر انتخاب کن 👇",
        [
            ["🎮 بازی‌ها", "👤 پروفایل"],
            ["🪙 کیف پول", "🎁 جایزه روزانه"],
            ["🏠 اتاق بازی"]
        ]
    )


# ==========================================
# منوی بازی‌ها
# ==========================================

def games_menu(chat_id):

    send_keypad(
        chat_id,
        "🎮 یکی از بازی‌ها را انتخاب کن:",
        [
            ["✂️ سنگ کاغذ قیچی"],
            ["🔢 حدس عدد"],
            ["🎲 تاس"],
            ["⬅️ برگشت"]
        ]
    )


# ==========================================
# منوی اتاق
# ==========================================

def room_menu(chat_id):

    send_keypad(
        chat_id,
        "🏠 مدیریت اتاق",
        [
            ["➕ ساخت اتاق"],
            ["🚪 ورود به اتاق"],
            ["⬅️ برگشت"]
        ]
    )


# ==========================================
# ساخت اتاق
# ==========================================

def create_room_menu(chat_id):

    send_keypad(
        chat_id,
        "🎮 بازی موردنظر را انتخاب کن:",
        [
            ["✂️ سنگ کاغذ قیچی"],
            ["⭕ دوز"],
            ["🃏 UNO"],
            ["🎭 مافیا"],
            ["🕵️ جاسوس"],
            ["⬅️ برگشت"]
        ]
    )