def get_title(level):

    ranks = [

        (1, "🥉 تازه‌کار"),
        (3, "🥈 بازیکن نوپا"),
        (5, "🥇 بازیکن"),
        (7, "🎮 بازیکن باتجربه"),
        (10, "🔥 بازیکن حرفه‌ای"),
        (13, "⚔️ جنگجو"),
        (16, "🛡 مبارز حرفه‌ای"),
        (20, "⚡ استاد"),
        (25, "💠 استاد بزرگ"),
        (30, "💎 الماسی"),
        (35, "👑 قهرمان"),
        (40, "🌟 قهرمان بزرگ"),
        (45, "🚀 افسانه"),
        (50, "🌌 افسانه بزرگ"),
        (60, "☄️ اسطوره"),
        (70, "🔱 اسطوره بزرگ"),
        (80, "🏰 فرمانروای Bangame"),
        (90, "🌠 فرمانروای افسانه‌ای"),
        (100, "🏆 پادشاه Bangame"),

    ]

    title = "🥉 تازه‌کار"

    for lvl, name in ranks:

        if level >= lvl:
            title = name

    return title