def get_title(level):

    ranks = [

        (1, "🥉 تازه‌کار"),

        (3, "🥈 بازیکن معمولی"),

        (5, "🥇 بازیکن حرفه‌ای"),

        (8, "🔥 جنگجوی VEXON"),

        (12, "⚡ استاد بازی"),

        (16, "💎 بازیکن الماس"),

        (20, "👑 قهرمان"),

        (30, "🌟 افسانه"),

        (50, "🚀 اسطوره VEXON"),

        (75, "🛡 فرمانروای بازی"),

        (100, "🏆 پادشاه VEXON")

    ]


    title = "🥉 تازه‌کار"


    for lvl, name in ranks:

        if level >= lvl:
            title = name


    return title